InformationRegisters/бит_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПользователей</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Значение настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/бит_НастройкиПользователей/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура открывает форму выбора основной группы пользователя.
//
// Параметры:
//  Пользователь   - СправочникСсылка.Пользователи.
//  ТекущиеДанные  - ТекущиеДанные.
//  Элемент        - Элемент.
//
&НаКлиенте
Процедура ВыбратьОсновнуюГруппуПользователя(Пользователь, ТекущиеДанные, Элемент)
	
	ПараметрыФормы = Новый Структура("Пользователь, ТекущаяГруппа", Пользователь, Запись.ЗначениеНастройки);
	
	ОткрытьФорму("Обработка.бит_РедактированиеНастроекПользователей.Форма.ФормаСпискаДоступныхГруппУправляемая", ПараметрыФормы, Элемент,,,, Новый ОписаниеОповещения("ВыбратьОсновнуюГруппуПользователяЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОсновнуюГруппуПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Запись.ЗначениеНастройки = Результат;
	
КонецПроцедуры // ВыбратьОсновнуюГруппуПользователя()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиПользователей;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним список типов для быстрого выбора составных типов.
	МассивТипов  = Метаданные.РегистрыСведений.бит_НастройкиПользователей.Измерения.Пользователь.Тип.Типы();
	СписокТиповПользователь = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("ВидОбъектаРегистрБухгалтерии" ,Перечисления.бит_ВидыОбъектов.РегистрБухгалтерии);
	фКэшЗначений.Вставить("СписокТиповПользователь"      ,СписокТиповПользователь);
	фКэшЗначений.Вставить("Настройка_ОсновнаяГруппа"	 , ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнаяГруппаПользователя);
	фКэшЗначений.Вставить("СписокУправленческихРегистров",СформироватьСписокУправленческихРегистровБухгалтерии());
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	ИзменениеНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	,Элемент
	,Запись
	,"Пользователь"
	,фКэшЗначений.СписокТиповПользователь
	,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Запись.Настройка = фКэшЗначений.Настройка_ОсновнаяГруппа Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбратьОсновнуюГруппуПользователя(Запись.Пользователь, Запись, Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция СформироватьСписокУправленческихРегистровБухгалтерии()
	
	СписокОбъектовСистемы = Новый СписокЗначений;
	
	Возврат СписокОбъектовСистемы;
	
КонецФункции // СформироватьСписокУправленческихРегистровБухгалтерии()

&НаСервере
Процедура ИзменениеНастройки()
	
	Запись.ЗначениеНастройки = Запись.Настройка.ТипЗначения.ПривестиЗначение(Запись.ЗначениеНастройки);
	
КонецПроцедуры // ИзменениеНастройки()

#КонецОбласти
